Tekla Open API Reference for Tekla Structures 2025
ClashChekerEvent.GetClashCheckHandler Method
 Returns a new clash check handler.
 Namespace: Tekla.Structures.Model.ClashChecker
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static ClashCheckHandler GetClashCheckHandler()
Public Shared Function GetClashCheckHandler As ClashCheckHandler
Return Value
Type: ClashCheckHandler
The new clash check handler instance.
See Also
Reference
ClashChekerEvent Class
Tekla.Structures.Model.ClashChecker Namespace